uhnp/src/InformationRegisters/НастройкиПравДоступаПользователейВидыОтчетовРазвернутые/НастройкиПравДоступаПользователейВидыОтчетовРазвернутые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПравДоступаПользователейВидыОтчетовРазвернутые</name>
  <resources>
    <name>Запись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Утверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОрганизацияИсточник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ГруппыДоступаОрганизацииВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчетаИсточник</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
      <types>CatalogRef.ГруппыДоступаКВидамОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательИсточник</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПользователиВидыОтчетов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательИсточник32</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПользователиВидыОтчетов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиПравДоступаПользователейВидыОтчетовРазвернутые/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		
		МодульНастройкаПрав=ОбщегоНазначения.ОбщийМодуль("НастройкаПравДоступаУХ");	
		МодульНастройкаПрав.НастройкиРазвернутыеПриЗаписи(ЭтотОбъект, "ВидыОтчетов");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись ИЗ ЭтотОбъект Цикл
		Если Запись.Организация=Справочники.Организации.ПустаяСсылка() Тогда
			 Сообщить(Нстр("ru = 'Значение поля ""Организация"" не может быть пустым! Проверьте состав группы доступа по организациям'"));
			 Отказ = Истина;
		КонецЕсли;
		
		Если Запись.ВидОтчета=Справочники.ВидыОтчетов.ПустаяСсылка() Тогда
			 Сообщить(Нстр("ru = 'Значение поля ""Вид отчета"" не может быть пустым! Проверьте состав группы доступа по видам отчетов'"));
			 Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

#КонецЕсли
